import { Modal, StyleSheet, View, ScrollView, TouchableOpacity, Text } from "react-native";
import { Input } from "../../../../ui/Input";
import { useEffect, useState } from "react";
import { useSelector } from "react-redux";
import { t } from '../../../../components/lang';
import { AppColors } from "../../../../styles/AppColors";

export const Position_professionModal = ({ visible, close, onPress }) => {
  const [search, setSearch] = useState('');
  const mainData = useSelector(st => st.mainData);
  const [profesions, setProfesins] = useState([])

  const constProfesions = [
    "Автомеханик",
    "Агент по недвижимости",
    "Агент по страхованию",
    "Администратор",
    "Администратор баз данных",
    "Адвокат",
    "Актёр",
    "Аналитик",
    "Арбитражный управляющий",
    "Архивариус",
    "Археолог",
    "Архитектор",
    "Астроном",
    "Аудитор",
    "Бармен",
    "Библиотекарь",
    "Бортпроводник",
    "Бренд-менеджер",
    "Брокер",
    "Бухгалтер",
    "Веб-дизайнер",
    "Ветеринар",
    "Ветеринарный врач",
    "Водитель",
    "Воспитатель",
    "Гематолог",
    "Географ",
    "Геодезист",
    "Геолог",
    "Гид",
    "Гинеколог",
    "Главный бухгалтер",
    "Графический дизайнер",
    "Девопс-инженер",
    "Девелопер",
    "Делопроизводитель",
    "Детский врач",
    "Детский психолог",
    "Дизайнер",
    "Дизайнер интерьеров",
    "Диетолог",
    "Диагност",
    "Директор по персоналу",
    "Журналист",
    "Зоолог",
    "Инженер",
    "Инженер-конструктор",
    "Инженер по безопасности",
    "Инженер по автоматизации",
    "Инженер по тестированию",
    "Инженер-проектировщик",
    "Инспектор",
    "Инструктор по йоге",
    "Инструктор по фитнесу",
    "Интернет-маркетолог",
    "Интервьюер",
    "Исследователь",
    "Историк",
    "Кассир",
    "Кардиолог",
    "Картограф",
    "Кинолог",
    "Кинопродюсер",
    "Кладовщик",
    "Клинический психолог",
    "Коуч",
    "Копирайтер",
    "Косметолог",
    "Криминалист",
    "Курьер",
    "Лаборант",
    "Ландшафтный дизайнер",
    "Литературный критик",
    "Логист",
    "Логопед",
    "Маркетолог",
    "Массажист",
    "Математик",
    "Менеджер",
    "Менеджер по обучению",
    "Менеджер по персоналу",
    "Менеджер по продажам",
    "Менеджер по качеству",
    "Менеджер по туризму",
    "Менеджер проектов",
    "Мерчендайзер",
    "Механик",
    "Микробиолог",
    "Модельер",
    "Музейный работник",
    "Музыкант",
    "Невролог",
    "Нефролог",
    "Нотариус",
    "Оператор видеокамеры",
    "Оператор видеомонтажа",
    "Оператор колл-центра",
    "Оператор станков с ЧПУ",
    "Организатор мероприятий",
    "Ортопед",
    "Официант",
    "Охранник",
    "Палеонтолог",
    "Парикмахер",
    "Патологоанатом",
    "Педиатр",
    "Переводчик",
    "Персональный ассистент",
    "Писатель",
    "Пилот",
    "Повар",
    "Полицейский",
    "Пожарный",
    "Пожарный инспектор",
    "Промоутер",
    "Промышленный дизайнер",
    "Программист",
    "Программист 1С",
    "Программист-разработчик",
    "Продуктовый менеджер",
    "Прокурор",
    "Прораб",
    "Проектный менеджер",
    "Продавец",
    "Продавец-консультант",
    "Психиатр",
    "Психолог",
    "Психолог-консультант",
    "Психотерапевт",
    "Пульмонолог",
    "Редактор",
    "Редактор новостей",
    "Режиссёр",
    "Реабилитолог",
    "Реаниматолог",
    "Риэлтор",
    "Рефлексотерапевт",
    "Сапожник",
    "Секретарь",
    "Системный администратор",
    "Системный аналитик",
    "Слесарь",
    "Слесарь-сантехник",
    "Смарт-контракт разработчик",
    "Сомелье",
    "Социолог",
    "Специалист по обучению персонала",
    "Специалист по закупкам",
    "Специалист по рекламе",
    "Специалист по связям с общественностью",
    "Спичрайтер",
    "Спортивный тренер",
    "Станочник",
    "Стоматолог",
    "Судебный эксперт",
    "Судья",
    "Сценарист",
    "Таможенник",
    "Татуировщик",
    "Тестировщик",
    "Технический директор",
    "Техник",
    "Торговый представитель",
    "Травматолог",
    "Тренер",
    "Тренинг-менеджер",
    "Туристический гид",
    "Уборщик",
    "Уролог",
    "Учитель",
    "Фармацевт",
    "Фельдшер",
    "Финансовый аналитик",
    "Финансист",
    "Физиотерапевт",
    "Флеболог",
    "Флорист",
    "Фотограф",
    "Фтизиатр",
    "Химик",
    "Хирург",
    "Хореограф",
    "Шахтёр",
    "Швея",
    "Шеф-повар",
    "Штурман",
    "Эколог",
    "Экономист",
    "Эксперт по недвижимости",
    "Экскурсовод",
    "Электрик",
    "Электронщик",
    "Электромонтёр",
    "Эндокринолог",
    "Ювелир",
    "Юрисконсульт",
    "Юрист"
  ];


  useEffect(() => {
    setProfesins(constProfesions)
  }, [])


  const SearcProfesions = (e) => {
    setSearch(e)
    let data = profesions.filter(elm => elm.toUpperCase().includes(e.toUpperCase()))
    setProfesins(data)
    if (e == '') {
      setProfesins(constProfesions)
    }
  }

  return (
    <View style={styles.centeredView}>
      <Modal
        animationType="slide"
        transparent={true}
        visible={visible}>
        <TouchableOpacity
          activeOpacity={1}
          onPress={() => close()}
          style={styles.centeredView}>
          <View style={styles.modalView}>
            <Input
              onChange={e => {
                SearcProfesions(e);
              }}
              value={search}
              placeholder={t(mainData.lang).search}
            />
            <ScrollView
              showsVerticalScrollIndicator={false}
              scrollEventThrottle={400}
            >
              {profesions.map((elm, i) => (
                <TouchableOpacity key={i} onPress={() => {
                  onPress(elm);
                  close();
                }}>
                  <Text key={i} style={styles.modalText}>{elm}</Text>
                </TouchableOpacity>
              ))}
            </ScrollView>
          </View>
        </TouchableOpacity>
      </Modal>
    </View>
  );
}

const styles = StyleSheet.create({
  centeredView: {
    flex: 1,
    justifyContent: 'center',
    alignItems: 'center',
    marginTop: 22,
  },
  modalView: {
    margin: 20,
    backgroundColor: 'white',
    borderRadius: 20,
    padding: 35,
    alignItems: 'center',
    shadowColor: '#000',
    shadowOffset: {
      width: 0,
      height: 2,
    },
    shadowOpacity: 0.25,
    shadowRadius: 4,
    elevation: 5,
    width: '80%',
    height: 300,
  },
  modalText: {
    marginBottom: 15,
    textAlign: 'center',
    color: 'black',
    color: AppColors.BaliHai_Color,
  },
  loadingMore: {
    paddingVertical: 10,
  },
});
